FLAP_FSI/FLUID/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.01/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          5756;
        startFace       4233;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          56;
        startFace       9989;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          42;
        startFace       10045;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       10087;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       10107;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       10137;
    }
)

// ************************************************************************* //
