FLAP_FSI/FLUID/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
//    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   28.9647;
    }
    thermodynamics
    {
        Cp          1004.9;
        Hf          2.544e+06;
    }
    transport
    {
        mu          1.837e-05;
        Pr          0.7;
    }
}

// ************************************************************************* //
