FLAP_FSI/FLUID/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "20";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2878
(
(1.00007 0 6.90327e-05)
(0.998217 7.78046e-15 0.00121245)
(0.995297 -8.57651e-15 0.00296272)
(0.997348 1.2689e-13 0.00595876)
(0.99156 0 0.0044662)
(0.992011 -7.85061e-14 0.0106576)
(0.99562 7.8596e-14 0.00924124)
(0.998735 -1.28291e-13 0.00353996)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    lowerWall
    {
        type            slip;
    }
    flap
    {
        type            slip;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
}


// ************************************************************************* //
