FLAP_FSI/FLUID/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "20";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
4233
(
0.0705974
0.0703487
0.000248731
0.0587229
0.0116257
0.066901
-0.0666523
0.0587229
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    flap
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
0.0214914
0.0048773
-0.0126955
-0.024975
-0.0356851
-0.0279747
-0.0133597
0.058693
0.0136301
0.0969596
0.121076
0.132646
0.136765
0.137323
0.136475
0.135248
0.134031
0.133045
0.132348
0.13203
)
;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-0.0705974
-0.0705974
-0.0705974
-0.0705974
-0.0705974
-0.0705974
-0.0705973
-0.0705973
-0.0705973
-0.0705973
-0.0705973
-0.0705972
-0.0705972
-0.0705972
-0.0705972
-0.0705972
-0.0705972
-0.0705972
-0.0705972
-0.0705972
)
;
    }
}


// ************************************************************************* //
