FLAP_FSI/FLUID/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2878
(
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
56
(
1.17662
1.17663
1.17659
1.17659
1.17662
1.17659
1.17663
1.17659
...
)
;
    }
    flap
    {
        type            calculated;
        value           nonuniform List<scalar> 
42
(
1.17659
1.17659
1.17663
1.17663
1.17663
1.17663
1.1766
1.1766
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
1.17659
1.17664
1.17666
1.17642
1.17672
1.17653
1.17659
1.17659
1.17659
1.1766
1.17661
1.17661
1.17661
1.17661
1.17661
1.17661
1.17661
1.17661
1.17661
1.17661
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
1.17662
1.17661
1.17661
1.17662
1.17662
1.17661
1.17662
1.17662
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
1.17662
)
;
    }
}


// ************************************************************************* //
