FLAP_FSI/FLUID/0/rhoUf
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceVectorField;
    location    "20";
    object      rhoUf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -2 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4233
(
(1.17579 4.45997e-15 0.000875875)
(1.1726 -9.62978e-16 0.00251504)
(1.174 8.10043e-14 0.00414551)
(1.16896 -4.61392e-15 0.00415309)
(1.16902 -5.40117e-14 0.00830386)
(1.17271 1.1906e-13 0.00907627)
(1.17433 5.94855e-16 0.00557835)
(1.16452 0 0.0045929)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
56
(
(1.16669 0 0)
(0.898344 0 0)
(0.341271 0 0)
(0.360453 7.6175e-16 0)
(1.17671 0 0)
(0.358372 0 0)
(0.172189 -1.4062e-13 0)
(0.163552 1.06457e-13 0)
...
)
;
    }
    flap
    {
        type            calculated;
        value           nonuniform List<vector> 
42
(
(0 0 -0.0251078)
(0 -1.54081e-13 -0.0146968)
(0 0 0.056019)
(0 0 0.127172)
(0 0 0.166252)
(0 1.48927e-13 0.209041)
(0 0 -0.0611906)
(0 0 -0.0454153)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(0.35819 0 -0.00826721)
(0.0812883 -1.53924e-13 -0.0328551)
(-0.211592 0 0.00226954)
(-0.416249 0 -0.0115761)
(-0.594752 0 -0.00709847)
(-0.466245 1.48088e-13 0.00281713)
(-0.222662 9.56784e-15 0.00780014)
(0.978217 -9.75839e-15 0.128621)
(0.227168 0 0.0650302)
(1.61599 1.44806e-13 0.197253)
(2.01793 1.42823e-13 0.240924)
(2.21077 5.49597e-16 0.254864)
(2.27941 0 0.248246)
(2.28871 -1.39531e-13 0.224533)
(2.27458 -1.36516e-16 0.19706)
(2.25413 0 0.164143)
(2.23385 6.8315e-17 0.126476)
(2.21742 -1.39517e-13 0.0995976)
(2.2058 -1.40026e-13 0.0477303)
(2.20051 -1.40057e-13 0.0295023)
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(1.45598 0 0)
(1.73425 0 0)
(1.76424 0 0)
(1.64106 -1.43399e-13 0)
(1.54527 0 0)
(1.68763 -1.51471e-13 0)
(1.592 1.42891e-13 0)
(1.49729 0 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
(1.17662 0 0)
)
;
    }
}


// ************************************************************************* //
