FLAP_FSI/FLUID/system/decomposeParDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}

    numberOfSubdomains 1;
    
    method hierarchical;
    hierarchicalCoeffs
    {
        n (1 1 1);
        delta 0.001;
        order xyz;
    }

    distributed false;
    roots
    (
    );

